import { Decoder } from "../";

describe("Decoder", () => {
  test("複雑なやつ", () => {
    const input =
      "A161618501F6190100A263E3818282F7F465E38182307AA161737878E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E38182E381823B000000012A05F1FF";
    const actual = Decoder.decode(input);
    expect(actual).toEqual({
      a: [
        1,
        null,
        256,
        {
          あ: [undefined, false],
          あ0z: {
            s:
              "ああああああああああああああああああああああああああああああああああああああああ",
          },
        },
        -5000000000,
      ],
    });
  });
});
